app/Models/BlogModel.php

SELECT *
FROM `blogs`
 LIMIT 6
---
    public function get_blog_all()
    {
            return $this->findAll(6);